[
  {
    "asin": "B0FSZWB9M5",
    "product_id": "B0FSZWB9M5",
    "title": "4K Digital Camera for Photography with WiFi 64MP Auto-Focus Vlogging Camera for YouTube Video 3'' 180° Flip Screen 4K Cameras 16X Zoom Anti-Shake Compact Point and Shoot Cameras with SD Card",
    "url": "https://www.amazon.com/Digital-Photography-Auto-Focus-Vlogging-Anti-Shake/dp/B0FSZWB9M5/ref=sr_1_1?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-1",
    "price": "$89.99",
    "rating": "4.6",
    "reviews": "537",
    "image_url": "https://m.media-amazon.com/images/I/71PGLyIa-XL._AC_UY218_.jpg",
    "amazon_choice": "Amazon'S Choice",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.228360",
    "source": "amazon",
    "brand": "Brand: AUREAPIX",
    "description": "Upgraded 4K Ultra HD Digital Camera with WiFi Transfer：This digital camera features 4K video resolution to help you record unforgettable moments in your life and travel. Simply download the \"Viipulse\" app, you can easily transfer photos and videos to your smartphone or tablet via WiFi connection, and share your life on YouTube, Instagram, Tiktok and other platforms anytime and anywhere. You can also use the app to remotely control the camera to shoot.\n64MP Image Resolution & Auto Focus & 16x Digital Zoom: This 4K digital camera for photography adopts the upgraded CMOS sensor, this vlogging camera has an Auto-Focus function that allows you to quickly capture stunning 64MP images. Even novice photographers can easily take clear and good-looking pictures. This vlog camera supports up to 16x digital zoom, so you can easily zoom in and out of the subject to take satisfying pictures.\nEasy to Use & 180° Flip Screen : Designed for beginners, this 4K camera is simple to use and you can easily switch between various modes (image, video, slow motion, filter, etc.) with the rotary dial on the top of the digital camera. This 4k vlogging camera has a 3'' 180° flip LCD screen, it is very convenient for selfies and suitable for recording vlogs and YouTube videos. The pause function allows you to pause at any time during recording, helping you save editing time and storage space.\nWebcam Function & 2 Charging Modes : This 4K digital camera with wifi can be used as a webcam. You can connect it to your PC via USB cable, and select “Webcam Mode” to live stream, video chat and vlog on YouTube, Facebook or Tiktok. The point and shoot digital camera also has 2 charging modes, you can charge the batteries via included convenient charging stand, or use USB to charge the batteries, this travel camera is great for long-lasting power for extended shooting sessions.\nMultiple-functional Portable Digital Camera 4K: The compact digital camera with flip screen has 20 filters and also features anti-shake, flash, video recording pause, continuous shooting, time-lapse, slow motion, motion detection and more, making this the camera for all indoors/outdoors activities. Our dedicated and experienced 24/7 team is available for all after purchase troubleshooting, questions and technical help.",
    "purchase_hint": "1k+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0FSZWB9M5_1769675239.jpg"
  },
  {
    "asin": "B08WZ5TF9H",
    "product_id": "B08WZ5TF9H",
    "title": "Fujifilm Instax Mini 12 Instant Camera Lilac Purple + Fuji Film Value Pack (40 Sheets) + Shutter Accessories Bundle, Incl. Compatible Carrying Case, Quicksand Beads Photo Album 64 Pockets",
    "url": "https://www.amazon.com/Fujifilm-Instant-Accessory-Compatible-Designer/dp/B08WZ5TF9H/ref=sr_1_2?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-2",
    "price": "$154.95",
    "rating": "4.6",
    "reviews": "1,639",
    "image_url": "https://m.media-amazon.com/images/I/71Efy7dXcRL._AC_UY218_.jpg",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.235048",
    "source": "amazon",
    "brand": "Visit the Fujifilm Store",
    "description": "Includes FujiFilm Mini 12 Camera Lilac Purple, The Fujifilm Mini 12 Camera Lilac Purple features a Fujinon 60mm f/12.7 Lens, Optical Image Viewfinder, Auto Exposure and a Built-In Flash. Instantly produces image prints fun and simple. Fujifilm Mini 12 Camera BUNDLE is Colorful, Fun, Compact and really Cool.\nIncludes 40 Film designed for shooting photos with a press of a button and instantly printing it out with the Fujifilm Mini series, enjoy to watch the images develop practically before your eyes.\nA unique Shutter fitted case with a removable strap for extra comfort was designed to both hold and protect your camera. Fashionable and practical. Be smart, be safe. Camera under Fujifilm USA warranty. Case and accessories under Shutter Brand Warranty\nFujifilm instax mini twin pack instant film (40 exposures) credit card size prints.\nNote: Film Packaging varies, Includes Two twin packs each containing 20 sheets, in retail packaging",
    "purchase_hint": "500+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B08WZ5TF9H_1769675242.jpg"
  },
  {
    "asin": "B07C2Z21X5",
    "product_id": "B07C2Z21X5",
    "title": "Canon EOS Rebel T7 DSLR Camera with 18-55mm Lens | Built-in Wi-Fi | 24.1 MP CMOS Sensor | DIGIC 4+ Image Processor and Full HD Videos",
    "url": "https://www.amazon.com/Canon-Rebel-T7-18-55mm-II/dp/B07C2Z21X5/ref=sr_1_3?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-3",
    "price": "$529.00",
    "original_price": "$579.99",
    "rating": "4.6",
    "reviews": "8,315",
    "image_url": "https://m.media-amazon.com/images/I/714hINuPoBL._AC_UY218_.jpg",
    "best_seller": "Best Seller",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.243915",
    "source": "amazon",
    "brand": "Visit the Canon Store",
    "description": "24.1 Megapixel CMOS (APS-C) sensor with is 100–6400 (H: 12800)\nBuilt-in Wi-Fi and NFC technology\n9-Point AF system and AI Servo AF\nOptical Viewfinder with approx 95% viewing coverage\nUse the EOS Utility Webcam Beta Software (Mac and Windows) to turn your compatible Canon camera into a high-quality webcam. Compatible Lenses- Canon EF Lenses (including EF-S lenses, excluding EF-M lenses)",
    "purchase_hint": "500+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B07C2Z21X5_1769675244.jpg"
  },
  {
    "asin": "B09JZRWRJN",
    "product_id": "B09JZRWRJN",
    "title": "Sony Alpha 7 IV Full-frame Mirrorless Interchangeable Lens Camera with 28-70mm Zoom Lens Kit",
    "url": "https://www.amazon.com/Sony-Full-frame-Mirrorless-Interchangeable-28-70mm/dp/B09JZRWRJN/ref=sr_1_4?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-4",
    "price": "$2,398.00",
    "original_price": "$2,699.99",
    "rating": "4.6",
    "reviews": "1,102",
    "image_url": "https://m.media-amazon.com/images/I/81jlDvZPMnL._AC_UY218_.jpg",
    "crawled_at": "2026-01-29T16:23:50.251009",
    "source": "amazon",
    "brand": "Visit the Sony Store",
    "description": "33MP full-frame Exmor R back-illuminated CMOS sensor\n8x more powerful, next generation BIONZ XR image processing engine\nUp to 4K 60p 10-bit 4:2:2 w/ full pixel readout in all recording formats\n7K oversampling full-frame 4K 30p 10-bit 4:2:2 w/ no pixel binning\nBeautiful color expression made simple with S-Cinetone color profile",
    "purchase_hint": "100+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B09JZRWRJN_1769675247.jpg"
  },
  {
    "asin": "B0BXMHR2M9",
    "product_id": "B0BXMHR2M9",
    "title": "Fujifilm Instax Mini 12 Instant Camera + MiniMate Accessory Bundle & Compatible Custom Case + Fuji Instax Film Value Pack (50 Sheets) Flamingo Designer Photo Album (Mint Green)",
    "url": "https://www.amazon.com/Fujifilm-MiniMate-Accessory-Compatible-Flamingo/dp/B0BXMHR2M9/ref=sr_1_5?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-5",
    "price": "$165.95",
    "rating": "4.6",
    "reviews": "2,075",
    "image_url": "https://m.media-amazon.com/images/I/71algiqoQzL._AC_UY218_.jpg",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.258273",
    "source": "amazon",
    "brand": "Visit the Fujifilm Store",
    "description": "The Fujifilm Instax Mini 12 Camera features a Fujinon 60mm Lens, Optical Image Viewfinder. Polaroid style- instant click and print camera producing credit card size prints. Quickly capture those fun moments and savor them forever\nSelfie Mirror Integrated on Lens - Built-In Flash and Auto Exposure Mode and has a Matching camera strap\nIncludes 50 Instax Film designed for shooting photos with a press of a button and instantly printing it out with the Fujifilm Mini series, enjoy to watch the images develop practically before your eyes\nMake the most of your Fujifilm instax mini 12 camera bundle and enjoy the fun MiniMate accessories we’ve provided in this kit: Fujifilm instax mini 12 camera, Instax mini film 50 exposures, Custom fitted MiniMate case & a 20 Pocket Flamingo print Photo Album\nNote: Film Packaging varies, Includes Two twin packs each containing 20 sheets, in retail packaging and an additional 10 sheets pack that may be in bulk packaging - A total of 50 Sheets.",
    "purchase_hint": "200+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0BXMHR2M9_1769675249.jpg"
  },
  {
    "asin": "B0BTCZ2RR9",
    "product_id": "B0BTCZ2RR9",
    "title": "Digital Camera, FHD 1080P Digital Point and Shoot Camera with 16X Zoom Anti Shake, 32GB Card, Compact Small Camera for Boys Girls Kids, Pink",
    "url": "https://www.amazon.com/Digital-Vlogging-Students-Seniors-Pink/dp/B0BTCZ2RR9/ref=sr_1_6?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-6",
    "price": "$39.99",
    "original_price": "$49.99",
    "rating": "4.2",
    "reviews": "9,260",
    "image_url": "https://m.media-amazon.com/images/I/61JavBEclHL._AC_UY218_.jpg",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.264007",
    "source": "amazon",
    "brand": "Visit the CAMKORY Store",
    "description": "SHOOT DECENT IMAGES WITH EASE - The digital camera captures high-clarity FHD 1080P videos and 44MP photos with the newest CMOS metering system, no need for complicated manual settings while delivering natural color images automatically. One second to press the shutter, it's easy for starters and kids.\nPORTABLE FOR TRAVEL & NICE BATTERY LIFE - The kids camera is a perfect everyday and take everywhere camera with it's petite body, durable, lightweight and small enough for your pocket. With two large capacity batteries, charging several times can last for one month. Plus, the automatic turn-off setting saves more energy in vacation trips and camping.\nVERY EASY TO USE - Conducted with ergonomic design, from easy to access buttons to simple functions menu, user-friendly interfaces down to the large LCD display, a 5-13 years kid can easily figure out. Just install the SD card, battery, two seconds to turn it on, and freely capture all fun memories with friends, family.\nENCOURAGE CREATIVE - If you are tired of its automatic results, the point and shoot camera allows you to customize pictures. 16X zoom is great for photographing objects in the distance. 20 pcs creative filter effects to take Vintage photos, Black/White photos..., Anti shake, webcam, face and smile detection, continuous shooting, self-timer, waiting for you to explore them.\nSUPERIOR SUPPORT FOR THIS GIFT - Backed by a one year hassle-free promise- refund and replacement. Digital camera, 32GB memory card, lanyard, storage bag, batteries, adapter, cable, exquisite box, contains everything you need. It is a perfect gift for boys, girls, teens on birthdays, Christmas or any important events, a first real camera for kids who love to take videos and pictures.",
    "purchase_hint": "6k+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0BTCZ2RR9_1769675252.jpg"
  },
  {
    "asin": "B0CG19FGQ5",
    "product_id": "B0CG19FGQ5",
    "title": "DJI Osmo Pocket 3 Creator Combo, Vlogging Cameras with 1'' CMOS, 4K/120fps Vlog Camera, 3-Axis Stabilization, Face/Object Tracking, Mic Included for Clear Sound, Digital Vlogging Camera for YouTube",
    "url": "https://www.amazon.com/DJI-Vlogging-Stabilization-Tracking-Photography/dp/B0CG19FGQ5/ref=sr_1_7?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-7",
    "price": "$619.00",
    "original_price": "$669.00",
    "rating": "4.6",
    "reviews": "5,161",
    "image_url": "https://m.media-amazon.com/images/I/51d4Esi79-L._AC_UY218_.jpg",
    "crawled_at": "2026-01-29T16:23:50.270956",
    "source": "amazon",
    "brand": "Visit the DJI Store",
    "description": "Capture Stunning Footage - This vlogging camera features a 1-inch CMOS sensor and records in 4K resolution at an impressive 120fps. Capture breathtaking night views and sunsets with enhanced clarity.\nEffortlessly Frame Your Shots - Get the ideal composition with Osmo Pocket 3's expansive 2-inch touch screen that rotates for both horizontal and vertical shooting.\nUltra-Steady Footage - Say goodbye to shaky videos. Osmo Pocket 3's advanced 3-axis mechanical stabilization delivers superb stability. Enjoy smooth footage while dancing, chasing pets, or vlogging.\nCreate Captivating Vlogs With ActiveTrack 6.0 - Stay effortlessly in focus as you record on the go. Set Osmo Pocket 3 up on a tripod and jump, dance, or spin, but remain center-frame.\nFast and Accurate Focusing - Osmo Pocket 3 locks onto your subject for sharp, clear footage. Whether filming action-packed scenes or still shots, it ensures every detail is captured.\nUnlock Advanced Color Grading - With D-Log M and 10-bit color depth, you can effortlessly record up to one billion colors and achieve stunning visual effects during post-production. Ideal for shooting sunrises and sunsets.\nImmersive Audio - Stereo recording captures high-quality sound, enhancing your videos with crystal-clear audio. From thrilling adventures to precious moments, this vlogging camera brings your memories to life.\nCompact and Convenient - This pocket-sized vlogging camera is incredibly portable and long-lasting, ensuring you never miss a moment. Take on adventures big and small—from traveling abroad to family gatherings.\nIncludes Osmo Pocket 3 starting set, the DJI Mic 2 Transmitter, battery handle, Osmo mini Tripod, and more. Battery charger sold separately. It's recommended to purchase the DJI 30W USB-C Charger.\nDJI OsmoAudio - Pocket 3 can connect directly to two DJI Mic 2/Mic Mini transmitters, ensuring high-quality audio for vlogs, interviews, and livestreams while simplifying your gear and workflow.",
    "purchase_hint": "4k+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0CG19FGQ5_1769675254.jpg"
  },
  {
    "asin": "B0BTTV6CT1",
    "product_id": "B0BTTV6CT1",
    "title": "Canon EOS R50 Mirrorless Camera RF-S18-45mm F4.5-6.3 is STM Lens Kit, 24.2 Megapixel CMOS (APS-C) Sensor, 4K Video, Hybrid Camera, Photo and Video, Vlogging, Content Creator, RF Mount, Black",
    "url": "https://www.amazon.com/Canon-Mirrorless-RF-S18-45mm-Smartphone-Connection/dp/B0BTTV6CT1/ref=sr_1_8?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-8",
    "price": "$799.00",
    "original_price": "$899.99",
    "rating": "4.6",
    "reviews": "1,631",
    "image_url": "https://m.media-amazon.com/images/I/71ANGtyZRzL._AC_UY218_.jpg",
    "crawled_at": "2026-01-29T16:23:50.278740",
    "source": "amazon",
    "brand": "Visit the Canon Store",
    "description": "High Image Quality: Canon EOS R50 4K digital camera features a 24.2 Megapixel CMOS (APS-C) sensor and DIGIC X processor for stunning image clarity and level of detail\nHigh-Speed Continuous Shooting: Capture fast action with up to 12 fps with Electronic First Curtain shutter and up tp 15 fps with Electronic Shutter for a superior vlogging camera\nAdvanced Auto Focus: Dual Pixel CMOS AF II covers up to 100% x 100% area with 651 AF zones; features auto subject detection and tracking of people, animals, and vehicles using deep learning technology — perfect 4K camera for video recording\nExceptional Low-Light Performance: Advanced A+ Assist offers an expanded array of auto-compatible scenes for greater expressive capability in auto mode and enables great imagery even in difficult settings such as night and backlit scenarios.\nFluid Video Capture: Video recording features such as 6K oversampled uncropped 4K movie at up to 30 fps, Full-HD High-frame rate movie recording at up to 120 fps: Movie for Close-up Demo Mode quickly and automatically switches focus to the subject closest to the camera\nSuperior Viewing Experience: 2.36-million-dot EVF with Clear View LCD II vari-angle touchscreen on this digital camera for easy composition and shooting from virtually any angle\nBuilt-In Bluetooth and Wi-Fi Capability: Enable wireless functions, such as file viewing and transfer, by connecting the video camera to Wi-Fi; use the free Canon Camera Connect app to connect your camera to compatible smart devices via Bluetooth pairing",
    "purchase_hint": "300+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0BTTV6CT1_1769675256.jpg"
  },
  {
    "asin": "B0BL7ZVY78",
    "product_id": "B0BL7ZVY78",
    "title": "Canon EOS R6 Mark II Mirrorless Camera (Body Only), Full-Frame Camera, 24.2 Megapixel CMOS Sensor, Photo and Video Capabilities, Black",
    "url": "https://www.amazon.com/Canon-EOS-Mark-Mirrorless-Oversampling/dp/B0BL7ZVY78/ref=sr_1_9?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-9",
    "price": "$1,999.00",
    "original_price": "$2,299.00",
    "rating": "4.7",
    "reviews": "558",
    "image_url": "https://m.media-amazon.com/images/I/61s5kI0U4cL._AC_UY218_.jpg",
    "crawled_at": "2026-01-29T16:23:50.286041",
    "source": "amazon",
    "brand": "Visit the Canon Store",
    "description": "FULL-FRAME CMOS SENSOR: 24.2 effective megapixels (approx.) lets you capture sharp, detailed images even in low-light conditions indoors and outdoors (compatible with Dual Pixel CMOS AF).\nDIGIC X IMAGE PROCESSOR: Enhances digital camera performance and processes, including image stabilization, image processing, and video functionality, for sharp, high-resolution images and video with minimal noise or grain.\nHIGH-SPEED CONTINUOUS SHOOTING: Electronic shutter speeds of up to 40 fps at 20MP let you capture dynamic action shots of athletes, animals, vehicles in motion, or even the split-second changes in facial expressions for portraits.\nENHANCED SUBJECT ACQUISITION: In addition to people, small animals, cars and motorcycles, the R6 Mark II also easily detects horses, trains, and aircraft, with the option to automatically select the subject type without manually switching.\nADVANCED HEAD, FACE, EYE DETECTION: Automatically detects and focuses on a person's head, face, or eye—even the left or right eye—plus, effectively tracks the whole body, face, or eye of animals for fast, accurate image or video capture.\nOPTIMIZED VIDEO RECORDING: Keep rolling without worry with up to 6 hours of continuous Full-HD video recording; capture 6K oversampled uncropped 4K movies up to 60 fps or Full-HD high-frame rate movie recording at up to 180 fps without overheating.\nWIRELESS COMMUNICATION: Built-in 5GHz Wi-Fi, and Bluetooth 5 technology makes it easy to upload and share photos and movies to your favorite social networks using the Canon Camera Connect app.\nWIRED CONNECTIVITY: The R6 Mark II features a USB Type-C9 port that lets you connect your digital camera directly to a USB-C enabled computer or smartphone using a compatible cable for lightning-fast file transfers at 10Gbps speeds.\nMULTI-ANGLE TOUCHSCREEN: 3.0-inch, 1.62 million dot Clear View LCD II Vari-angle Touchscreen makes it easy to compose the perfect shot from nearly any angle.\nPRECISION ELECTRONIC VIEWFINDER: 0.5-inch OLED electronic viewfinder features 3.69 million dots (approx.) and a 120 fps refresh rate for a bright, sharp, and vivid 100% view of your subject for superior shot composition.",
    "purchase_hint": "300+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0BL7ZVY78_1769675258.jpg"
  },
  {
    "asin": "B00012YIA0",
    "product_id": "B00012YIA0",
    "title": "Fujifilm QuickSnap Flash 400 One-Time-Use Camera -2 Pack",
    "url": "https://www.amazon.com/Fujifilm-Quicksnap-Flash-Single-Use-Camera/dp/B00012YIA0/ref=sr_1_10?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-10",
    "price": "$34.49",
    "rating": "4.7",
    "reviews": "3,984",
    "image_url": "https://m.media-amazon.com/images/I/61hvAriwWmL._AC_UY218_.jpg",
    "crawled_at": "2026-01-29T16:23:50.293400",
    "source": "amazon",
    "brand": "Visit the Fujifilm Store",
    "description": "One-Time-Use camera\nGreat for indoors and outdoors\nEasy to use\nContinuous flash switch",
    "purchase_hint": "3k+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B00012YIA0_1769675260.jpg"
  },
  {
    "asin": "B09ZRN1N3Z",
    "product_id": "B09ZRN1N3Z",
    "title": "Kodak PIXPRO FZ55-BK 16MP CMOS Sensor Digital Camera 5X Optical Zoom 28mm Wide Angle 1080P Full HD Video 2.7\" LCD Vlogging Camera (Black)",
    "url": "https://www.amazon.com/PIXPRO-Friendly-FZ55-BK-Digital-Optical/dp/B09ZRN1N3Z/ref=sr_1_11?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-11",
    "price": "$139.99",
    "original_price": "$159.99",
    "rating": "4.4",
    "reviews": "5,778",
    "image_url": "https://m.media-amazon.com/images/I/81swjZCbdiL._AC_UY218_.jpg",
    "best_seller": "Best Seller",
    "crawled_at": "2026-01-29T16:23:50.301411",
    "source": "amazon",
    "brand": "Visit the KODAK Store",
    "description": "16 Megapixel CMOS Sensor\n5X Optical Zoom - 28mm Wide Angle Lens\n1080P Full HD Video - Vlogging Camera\nSD Card Compatibility: At least Class 10, no more than 512GB (SD, SDHC, SDXC)\n2.7\" LCD Screen - Rechargeable Li-Ion Battery",
    "purchase_hint": "10k+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B09ZRN1N3Z_1769675262.jpg"
  },
  {
    "asin": "B0FP562KVT",
    "product_id": "B0FP562KVT",
    "title": "8K Digital Cameras for Photography with WiFi,Autofocus 88MP Vlogging Camera for YouTube with Dual-Lens,16X Digital Zoom Point and Shoot Camera,3.2''Touch Screen, Anti-Shake,2 Batteries &Charging Stand",
    "url": "https://www.amazon.com/Photography-Autofocus-Dual-Lens-Anti-Shake-Batteries/dp/B0FP562KVT/ref=sr_1_12?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-12",
    "price": "$129.99",
    "original_price": "$169.99",
    "rating": "4.5",
    "reviews": "337",
    "image_url": "https://m.media-amazon.com/images/I/71y5zbgLljL._AC_UY218_.jpg",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.308564",
    "source": "amazon",
    "brand": "Brand: FlyFrost",
    "description": "【2026 LATEST 8K UHD 88MP AUTOFOCUS DIGITAL CAMERA】: Our 8K digital camera Equipped with 8K video resolution, Also can shooting 88MP photos with true-to-life color and detail. Advanced autofocus instantly locks onto the subject, ensuring clear photos even when in motion, while the 16X digital zoom lets you get closer without sacrificing image quality. Whether you're capturing family trips, daily moments, or creating video content, it delivers sharp images and smooth videos.\n【WIFI TRANSFER & WEBCAM】:This vlog camera comes with built-in WiFi, allowing you to instantly upload and share videos and photos directly to social media platforms by simply downloading the \"iSmart DV2\" app on your Android or iOS device.Our 8K digital cameras for Photography is also ideal for video calls and live streaming on YouTube or social media.And perfect for quick sharing your joy on social media or cloud backup.has 6-axis stabilization that ensuring smoother videos, It is well-suited for both professionals and beginners.\n【DUAL LENS & 3.2\" IPS TOUCH SCREEN PROFESSION CAMERA】:This portable digital camera features both front and rear lenses, allowing you to switch between them with a single touch for effortless selfies or content creation.Featuring a 3.2-inch large touch screen, it streamlines framing, focusing, and capturing with a simple touch. Ideal for preserving your clearest and most memorable moments.\n【360°ROTARY DIAL EASY TO OPERATE】:This digital cameras for photography support 360° rotating button design allows you to easily switch between 8 shooting modes, including: auto mode,filters, program ,scene, portrait, landscape, slow motion, time-lapse.Capture your adventures and daily moments with this versatile camera, designed for effortless travel photography and stunning video recording.\n【LONG BATTERY LIFE & AMPLE STORAGE】:Our cameras for photography equipped with two large capacity rechargeable battery and a 32GB SD card, this vlogging camera supports long shooting sessions without interruptions.The powerful battery lets you shoot all day without worrying about power or memory. Whether it's a birthday, a holiday or a special occasion, this digital camera is the perfect present to inspire creativity and capture memories.A present that combines fun, creativity and technology.",
    "purchase_hint": "500+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0FP562KVT_1769675264.jpg"
  },
  {
    "asin": "B0B8PDHRWY",
    "product_id": "B0B8PDHRWY",
    "title": "Kodak PIXPRO Friendly Zoom FZ45-BK 16MP Digital Camera with 4X Optical Zoom 27mm Wide Angle and 2.7\" LCD Screen (Black)",
    "url": "https://www.amazon.com/KODAK-Friendly-FZ45-BK-Digital-Optical/dp/B0B8PDHRWY/ref=sr_1_13?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-13",
    "price": "$119.95",
    "original_price": "$129.99",
    "rating": "4.3",
    "reviews": "4,842",
    "image_url": "https://m.media-amazon.com/images/I/81gAqtMl3AL._AC_UY218_.jpg",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.315776",
    "source": "amazon",
    "brand": "Visit the KODAK Store",
    "description": "4x Optical Zoom - 27mm Wide Angle Lens\n16MP CMOS Sensor\n1080p Full HD Video - Vlogging Camera\nSD Card Compatibility: At least Class 10, no larger than 512GB (SD, SDHC, SDXC)\n2.7\" LCD",
    "purchase_hint": "4k+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0B8PDHRWY_1769675266.jpg"
  },
  {
    "asin": "B0CG19QXWD",
    "product_id": "B0CG19QXWD",
    "title": "DJI Osmo Pocket 3, Vlogging Cameras with 1'' CMOS & 4K/120fps Vlog Camera, 3-Axis Stabilization, Fast Focusing, Face/Object Tracking, Digital Vlogging Camera for YouTube",
    "url": "https://www.amazon.com/DJI-Stabilization-Rotatable-Touchscreen-Photography/dp/B0CG19QXWD/ref=sr_1_14_mod_primary_new?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=8-14",
    "price": "$489.99",
    "original_price": "$522.00",
    "rating": "4.5",
    "image_url": "https://m.media-amazon.com/images/I/61tukvVUMiL._AC_UY218_.jpg",
    "best_seller": "Best Seller",
    "crawled_at": "2026-01-29T16:23:50.326151",
    "source": "amazon",
    "brand": "Visit the DJI Store",
    "reviews": "2,474",
    "description": "Capture Stunning Footage - This vlogging camera features a 1-inch CMOS sensor and records in 4K resolution at an impressive 120fps. Capture breathtaking night views and sunsets with enhanced clarity.\nEffortlessly Frame Your Shots - Get the ideal composition with Osmo Pocket 3's expansive 2-inch touch screen that rotates for both horizontal and vertical shooting.\nUltra-Steady Footage - Say goodbye to shaky videos. Osmo Pocket 3's advanced 3-axis mechanical stabilization delivers superb stability. Enjoy smooth footage while dancing, chasing pets, or vlogging.\nCreate Captivating Vlogs With ActiveTrack 6.0 - Stay effortlessly in focus as you record on the go. Set Osmo Pocket 3 up on a tripod and jump, dance, or spin, but remain center-frame.\nFast and Accurate Focusing - Osmo Pocket 3 locks onto your subject for sharp, clear footage. Whether filming action-packed scenes or still shots, it ensures every detail is captured.\nUnlock Advanced Color Grading - With D-Log M and 10-bit color depth, you can effortlessly record up to one billion colors and achieve stunning visual effects during post-production. Ideal for shooting sunrises and sunsets.\nImmersive Audio - Stereo recording captures high-quality sound, enhancing your videos with crystal-clear audio. From thrilling adventures to precious moments, this vlogging camera brings your memories to life.\nCompact and Convenient - This pocket-sized vlogging camera is incredibly portable and long-lasting, ensuring you never miss a moment. Take on adventures big and small—from traveling abroad to family gatherings.\nIncludes Osmo Pocket 3, a protective cover, wrist strap, a handle with 1/4\" thread, and more. A great choice for first-time vloggers. Battery charger sold separately. It's recommended to purchase the DJI 30W USB-C Charger.\nDJI OsmoAudio - Pocket 3 can connect directly to two DJI Mic 2/Mic Mini transmitters, ensuring high-quality audio for vlogs, interviews, and livestreams while simplifying your gear and workflow.",
    "purchase_hint": "3k+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0CG19QXWD_1769675268.jpg"
  },
  {
    "asin": "B0FW4QMWJS",
    "product_id": "B0FW4QMWJS",
    "title": "4K Digital Camera for Beginners & Teens – Easy-to-Use 64MP WiFi Vlogging Camera, 3” 180° Flip Screen, Autofocus Point and Shoot Camera with 32GB Card & 2 Batteries, Compact Travel Camera",
    "url": "https://www.amazon.com/Digital-Photography-Autofocus-Vlogging-Anti-Shake/dp/B0FW4QMWJS/ref=sr_1_15?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-15",
    "price": "$59.98",
    "original_price": "$79.99",
    "rating": "4.7",
    "reviews": "206",
    "image_url": "https://m.media-amazon.com/images/I/81+ZO-AMKNL._AC_UY218_.jpg",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.334623",
    "source": "amazon",
    "brand": "Visit the ToAuite Store",
    "description": "📸48MP Clear Photos & Smooth 4K Video — No Skills Needed: Just press the shutter and let the camera do the work. Autofocus locks onto your subject automatically, while built-in anti-shake helps keep photos sharp and videos steady—even if your hands move. Perfect for first-time users who want great results without learning photography.\n📱 Share in Seconds with Built-In WiFi: Send photos and videos straight to your phone—no cables, no laptop. Edit and upload to Instagram, TikTok, or YouTube anytime. You can even control the camera from your phone for group photos or hands-free selfies.\n🤳 Flip Screen for Selfies, Vlogs & YouTube: The 3-inch 180° flip screen lets you see yourself while filming or taking selfies—no guessing, no retakes. Whether you’re recording a vlog, TikTok, or video call, framing yourself is simple and natural.\n🎒 Lightweight & Travel-Friendly for Everyday Life: Small enough to fit in your bag, powerful enough to capture trips, family moments, and daily life. The built-in flash and 16X zoom help you shoot clearly day or night—at home, on vacation, or on the street.\n🎁 A Complete Starter Camera — Ready Out of the Box: Comes with a 32GB SD card and 2 rechargeable batteries, so you can start shooting right away. A thoughtful gift for beginners, teens, adults, or seniors. Backed by a 2-year warranty and friendly support for total peace of mind.",
    "purchase_hint": "300+ bought\nin past month",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0FW4QMWJS_1769675270.jpg"
  },
  {
    "asin": "B0BWNZLQ69",
    "product_id": "B0BWNZLQ69",
    "title": "Fujifilm Instax Mini 12 Instant Film Camera - Pastel Blue",
    "url": "https://www.amazon.com/Fujifilm-Instax-Mini-Instant-Camera/dp/B0BWNZLQ69/ref=sr_1_16?dib=eyJ2IjoiMSJ9.zb9-z77cNmJAUNpxdsYU-jDwPsPIRBzlmaYUc8BYauxCerFSRUQGSNEkAXtvFy8VHqYAIWuTcAbJh9TSSYQFNZMhiBNLGIULy_Yli-TNXVY1G3vQolt0yUBf3xr4rPmejdICsKVWc3Azdctt9KRGT1pxQObSEF_UGMnWsb5j5Keaw_1xCBh6q251E1xToXid1QWwQeIAWhALMNb2QInxXukotGtF-3iUKH-gSLJVYF8.nykpjyl9RdSn1AgYRBVWnfCQcseL91tAnZ5VMZ8xy_g&dib_tag=se&keywords=%E7%9B%B8%E6%9C%BA&qid=1769675030&sr=8-16",
    "price": "$83.70",
    "original_price": "$93.95",
    "rating": "4.6",
    "reviews": "5,447",
    "image_url": "https://m.media-amazon.com/images/I/5119FirQf8L._AC_UY218_.jpg",
    "prime_eligible": "Prime",
    "crawled_at": "2026-01-29T16:23:50.342151",
    "source": "amazon",
    "brand": "Visit the Fujifilm Store",
    "description": "Compact and cute design. Easily twist the lens to turn on and off\nBuilt-in selfie mirror for easy selfies Close-up mode with parallax correction\nFeatures automatic exposure and flash control for bright photos that are not “washed-out”\nPrints out high-quality, 2” x 3” INSTAX MINI instant photos in approximately five seconds (Development time thereafter is approximately 90 seconds). Uses INSTAX MINI instant film, which is sold separately.\nIncludes: Hand strap, user manual, (2) AA batteries and 1-year limited warranty",
    "image_path": "D:\\Study_data\\InfoCrawler-main\\encrypt_decrypt\\Amazon_add1\\1\\ecommerce_data\\amazon\\images\\B0BWNZLQ69_1769675272.jpg"
  }
]